#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b8d6e0e3-16ef-420c-9023-9491ae455592]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1d80fc3b-53f3-445f-ae5d-17ecda974dc4]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2ed11e98-cd6c-4bfe-8ecb-9815639d2013]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1894e0b6-3220-4e55-aef2-62ac8633d749]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7cacc2dd-cb87-4307-b2e3-2ac5b5b4aa45]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3fc938a8-20c2-4d86-90f4-08a47397d98f]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f2c0de65-f0d4-4f61-8735-18249259a8b2]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=28eb7152-535f-496d-a9ef-1d21fe192658]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ce6ea809-4bef-4698-b41b-f75f557411e4]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4519026e-5021-4bf9-8666-5abf8299bf60]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2a325e14-d47e-4644-80b5-d848690ba170]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da6779a0-0be1-428a-8bfc-d2afbf5b6165]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=60e9db57-1248-48e2-9536-4976df3b9bbe]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=30c5e7aa-3308-433b-8350-f667d373e900]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d8658960-f51e-46e0-b883-51684c853e7a]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9fa93754-b89c-427f-bae1-7667c3633fb7]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=e44b7686-2ae0-4419-bd11-eb879ceaab42]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=73f88659-af56-4dda-a55f-f714e7e02d62]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ca648b3a-3833-46d5-8ab3-2bb808c95ab2]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=257a42fa-fa32-4ef7-91fa-51171adfd481]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=afac9850-f9d3-4899-89f5-9486022c3b8c]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9304e4b7-cd10-40cd-a93f-fb485cc403a2]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f91921b6-4275-4ebb-a095-52e398d670a7]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1de099fc-7d8d-413e-8b6b-7b645ce5e4fc]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=04e0ab02-da21-4140-8b0a-5d1f053c9c6a]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7f7e3b98-6bc1-47e2-8459-070c0a3bef97]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c060cd56-77bb-45e8-a06a-0bcece138785]
module.keycloak_test.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d747bb2e-569a-455a-888b-497f4bf6f1d3]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e293ae15-2f49-42c9-8c08-6e5c10f90146]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=688e03be-5cb4-404f-8bfd-c7cbf0b4224d]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=85518fd0-3a86-4920-97a4-d24169e7746c]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5389d378-c110-4a0c-98b1-8aa6ddcd1b55]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e9e4844d-f0e9-437a-9f21-b8783b86e383]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2ab1f2d9-93d7-4b13-8719-a6ad1fae117f]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=24d6a278-8117-4ff9-89dc-edf9cea100dc]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=3f48e31e-689e-418a-8995-7cef22ba32fc]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2eb38390-43c7-4dc5-8a21-673fa9b1a62e]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f535caee-8644-4902-bd68-515a3ca495d4]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63147a5d-cf14-4564-bf00-ebc28475dbcb]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=37f8e6b5-010a-4ed0-9e04-584e977d0417]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=627b2686-c05c-4345-8e6d-fedf0fa8359f]
module.keycloak_test.module.onestopauth.module.client_testapp-20211012-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=946b5cb2-d9ec-4996-93cf-9404fa877725]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7b6175f9-1536-46a6-84be-c74efea935dd]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b34d3c6c-acfb-4e92-a5e0-80ab828e04ad]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=811447b7-2364-4616-827e-e03dd26d5b47]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=665a4474-d98b-40ab-a1e1-5a730562abf6]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=14cbd4c7-ae2e-4d10-90b1-d5edadcf7ef9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=e01aca93-8214-4dce-83a5-f539070ae746]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e5ef86d1-32b3-40ae-a24e-52075e5dd812]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8add2fbc-a436-4fea-b1c7-3c0f693430da]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f79494f5-cd77-4f18-91dd-c052c31d5365]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d00ec7d0-f428-4c8e-8845-2da0bf2bb7c3]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0dee05e9-9602-4466-8e65-bf0a4e2d987d]
module.keycloak_test.module.onestopauth.module.client_asdf-2222222222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a3a2b3e4-f17d-4bfe-aef1-0d9966cc3084]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1ae17d1a-b0a0-42be-8fb1-7d7608f5eaa7]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6317a050-c995-4dc6-ad37-a28320f6a124]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a84a1e9-440d-4c78-9646-9a55b7926503]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ac3656b-5da0-447d-9519-440afd8687af]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4f855c0c-3524-478b-9cf9-538c12908dfb]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d2124eac-55d8-451b-9d2a-13b86fcfb850]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3e4af1e6-d149-4d49-b690-b0e577a5f9c8]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a1c87ad9-59a6-45e7-a19e-9d6db6dcad41]
module.keycloak_test.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2b5e5850-ee20-4408-9e7c-c959dd6bcf2e]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bddfa5ec-712e-4cf8-a161-6e19f62d22cf]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aed0804c-9836-4c6c-996e-fbc78400786a]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=eac0e0fa-360f-4d3d-9281-560fac48666c]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=584eea7d-e5c4-4dfd-bda4-622e7d55f7c3]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=25dfc71f-2263-428b-8516-909100cc565e]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4606ea0f-d938-429e-9fec-077d9cef3198]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ebff25e5-99f1-4646-a5be-90587efaae54]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=20ced261-510e-407a-b97e-f17138ca573c]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=042ec40a-fef9-43c9-9292-eb681b0c1c61]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3a7ce87c-4b11-4ebb-a19d-2a24cb3e1ee6]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=43f4e27e-c2eb-49fd-8d4a-8920492f0d49]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=84d46c9b-8dc6-494a-ba45-3ebdeeea8a5b]
module.keycloak_test.module.onestopauth.module.client_jon-test-6-337.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf0a4fff-d1d2-41c4-92b4-fa5f848ba58f]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8bebc95e-3978-4dd0-a480-71403405172b]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c26b7240-a887-461a-bcc7-d36f69ca1155]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5db4915d-465f-49ae-8df4-28a66364cd88]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=109be7e6-8e80-4a7d-a87d-b092f8395958]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=166a0a9b-7bed-4076-b9b0-9e6d8763d890]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=79da43e5-49c8-47e1-97a6-77b95d261005]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fe82c085-65b5-4720-832f-2c75a1cff0b3]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=18a7cd72-1170-44da-ad0e-f1126445a015]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4193c24e-5ad0-450b-b023-1b9eedbb2f2d]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=992f6c45-2b5e-4182-b934-d57e4e6cdafa]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0b15646-a6e6-4347-bbf3-fb28bd3be25d]
module.keycloak_test.module.onestopauth.module.client_test-5-730.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44a31931-f693-4665-8248-8bf5e70f9da4]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b2b1fe86-5adc-4ee1-94b8-457370cf5097]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a395df78-e767-40f7-a975-4f13b5948c0d]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7a6bf366-9217-4f02-a763-3e1c690efc87]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8f0f23b7-4bcc-4453-abf9-945a8d4b3892]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b986e130-d5c1-458a-a062-ba7153ffc1c3]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=111edcb2-a105-4e03-ad38-fe7d1052dec0]
module.keycloak_test.module.onestopauth_business.module.client_march-2-b-ce-id-all-prod-6044.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d9dbed4d-96f3-44a0-8464-49b49a9b4431]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1c643ed-e3ef-4d86-83f6-58262266e7a9]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=017f22ec-5c7d-4dfa-84ac-2fddcfb3427a]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0dfdd338-3d7a-493f-972e-aa90f9dca813]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b35b50bc-4e9f-489e-a07f-094fc3b5f6fb]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=efe0636e-fec0-45c1-a010-dca3bd92fbdd]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1766753c-5bec-4425-b67b-99096816e02e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c12bf377-f60c-4b79-b1ef-5828f1ab66f9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2ad14a42-adf0-4eb6-b87f-04478a1b85ba]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8e38de05-06d5-436a-9de0-b320970d2c38]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=771cf276-c9b5-42d8-ad89-11674cbabf0e]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c29c273e-4919-4ee1-a9c7-e94028642638]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=af79bb43-7e01-4a26-9813-bd8eccce45ec]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=919a2516-5484-44bf-ba5d-298b70c76a83]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://DevBCeID.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://DevBCeID.com",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_kuro-mar-04-b-ce-id-basic-non-prod-6305.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "kuro-mar-04-b-ce-id-basic-non-prod-6305"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://TestBCeID.com",
        ]
      + web_origins                              = [
          + "+",
          + "http://TestBCeID.com",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3744 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*